// 11726, 11727, 9095, 10844, 11057, 2193, 9465, 2156, 11053, 11055, 11722, 11054, 1912, 2579, 1699, 2133, 9461, 2225, 2011, 11052

#include <bits/stdc++.h>

using namespace std;
// 1 <= n <= 1000 이기때문에계싼식에서계속%10007을해줘야intoverflow가나지않는다

// 경우의 수를 fn으로 가정할 시 2*1 1*2 res = fn + fn;
// 11727번의 경우 경우의 수가 3개 2*1 1*2 2*2 2f1 + f2 가 됌
int main(){
    int n; cin >> n;
    int a=1, b=1, c=1;
    for(int i = 0; i < n-1; i++){
        c = a;
        a = b;
        b = (c + b) % 10007;
    }
    cout << b ;
}
